[
	{
		"title":"E-Government Academy",
		"content":"E-Government may be understood as the art of implementing Governance by adopting, deploying and applying Information and Communications Technology to enhance performance - using electronic media facilities and devices to accelerate the efficient, speedy and transparent delivery of Information content and Data to the public and other Agencies, and for carrying out government administrative activities."
	},
	{
		"title":"Software and AutoCAD Platform",
		"content":"Auto CAD is a commercial software application for 2D and 3D computer-aided design (CAD) and drafting — available since 1982 as a desktop application and since 2010 as a mobile web- and cloud-based App. marketed as Auto CAD 360. Developed and marketed by Autodesk, Auto CAD was first released in December 1982, running on microcomputers with internal graphics controllers. Prior to the introduction of Auto CAD, most commercial CAD programs ran on mainframe computers or minicomputers, with each CAD operator (user) working at a separate graphics terminal. Auto CAD is used across a wide range of industries, by Architects, project Managers, Engineers, Graphic designers, and other professionals. It is supported by 750 training centers worldwide as of 1994."
	},
	{
		"title":"ICT Innovation Platform",
		"content":"Innovation is a new idea, or more-effective device or process. Innovation can be viewed as the application of better solutions that meet new requirements, unarticulated needs, or existing market needs. This is accomplished through more-effective products, processes, services, technologies, or business models that are readily available to markets, governments and society. The term 'innovation' can be defined as something original and more effective and, as a consequence, new, that 'breaks into' the Market or Society."
	},
	{
		"title":"Electronics and Multimedia Development Center",
		"content":"Multimedia is content that uses a combination of different content forms such as text, audio, images, animation, video and interactive content. Multimedia contrasts with media that use only rudimentary computer displays such as text-only or traditional forms of printed or hand-produced material. Multimedia can be recorded and played, displayed, dynamic, interacted with or accessed by information content processing devices, such as computerized and electronic devices, but can also be part of a live performance."
	},
	{
		"title":"E-Library, Research &  E-Learning Centre",
		"content":"A digital library is a special library with a focused collection of digital objects that can include text, visual material, audio material, video material, stored as electronic media formats (as opposed to print, microform, or other media), along with means for organizing, storing, and retrieving the files and media contained in the library collection."
	},
	{
		"title":"CBT Practice & Mentoring Centre",
		"content":"Computer-based training (CBT) is any course of instruction whose primary means of delivery is a computer. A CBT course (sometimes called courseware ) may be delivered via a software product installed on a single computer, through a corporate or educational intranet, or over the Internet as Web-based training . CBT can be used to teach almost any conceivable subject, but it is especially popular for computer-related studies."
	},
	{
		"title":"Business Process Centre",
		"content":"Computer business centers are mostly profitable businesses to run in Nigeria as they offer services which are mostly not too competitive yet. Not many people know how to use computers in Nigeria and there is cool money to be made by offering computer services to such people. The market does not just consist of people who are not computer literate but also to those who are but still need the services of a business center for one reason or another."
	},
	{
		"title":"ICT Process Certification Centre",
		"content":"Our training program is aimed at developing a Community of certified professionals, and providing organizations with the opportunity to ensure their staff are fully trained and proficient in the implementation of ICT products. Whether you prefer the flexibility of self-paced online training, or the structure and interaction of an instructor-led classroom course, there’s an option to suit you."
	}
]